/*
Определить номер четверти плоскости, в которой находится точка с координатами X и Y , причем XY != 0. Координаты вводить с клавиатуры.
*/

#include <iostream>

int main() {
    double X, Y;

    // Ввод координат
    std::cout << "Введите координату X: ";
    std::cin >> X;
    std::cout << "Введите координату Y: ";
    std::cin >> Y;

    // Проверка на принадлежность к четверти
    if (X > 0 && Y > 0) {
        std::cout << "I четверть плоскости" << std::endl;
    } else if (X < 0 && Y > 0) {
        std::cout << "II четверть плоскости" << std::endl;
    } else if (X < 0 && Y < 0) {
        std::cout << "III четверть плоскости" << std::endl;
    } else if (X > 0 && Y < 0) {
        std::cout << "IV четверть плоскости" << std::endl;
    }

    return 0;
}



